# yolov8-bezier.yaml
# Parameters
nc: 1  # number of classes
kpt_shape: [4, 3]  # Bézier curve with 4 control points (x,y)
scales:
  n: [0.33, 0.25, 1024] # YOLOv8n scale

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]   # 9

# YOLOv8.0n head with EAMRF
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12 -> Standard C2f (First Top-Down Fusion)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, EAMRF, [256]]      # 15 -> EAMRF (P3 Output to Head)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat top-down P4
  - [-1, 3, EAMRF, [512]]      # 18 -> EAMRF (P4 Output to Head)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P5
  - [-1, 3, EAMRF, [1024]]     # 21 -> EAMRF (P5 Output to Head)

  - [[15, 18, 21], 1, Pose, [nc, [4, 3]]] # Decoupled Pose Head