# EAMRF Custom Architecture - Instance Segmentation
# Used for Comparing the model's performance on Instance Segmentation tasks against SAM-based approaches

nc: 1  # 1 class (Fish)
scales:
  n: [0.33, 0.25, 1024] # YOLO11n scale

# YOLO11 Backbone (SOTA Feature Extraction)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]    # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 2, C2PSA, [1024]]         # 10 - YOLO11 Position-Sensitive Attention

# Custom EAMRF Neck (Underwater Fusion)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]      # cat backbone P4
  - [-1, 3, EAMRF, [512]]          # 13 

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]      # cat backbone P3
  - [-1, 3, EAMRF, [256]]          # 16 

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # cat top-down P4
  - [-1, 3, EAMRF, [512]]          # 19 

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # cat top-down P5
  - [-1, 3, EAMRF, [1024]]         # 22 

  # THE ONLY CHANGE: Standard Segment Head instead of Pose/ Detection Head
  - [[16, 19, 22], 1, Segment, [nc, 32, 256]] # 23